#Даны два круга с общим центром и радиусами R1 и R2 (R1 > R2). Найти площади
# этих кругов S1 и S2, а также площадь S3 кольца, внешний радиус которого
# равен R1, а внутренний радиус равен R2: S1 = π·(R1)2, S2 = π·(R2)2, S3 = S1 − S2.
# В качестве значения π использовать 3.14.
pi = 3.14
R1 = float(input('Введите радиус большего круга: '))
R2 = float(input('Введите радиус меньшего круга: '))
S1 = pi * R1 ** 2
S2 = pi * R2 ** 2
S3 = S1 - S2
print(f'Площадь большего круга равна: {S1}')
print(f'Площадь меньшего круга равна: {S2}')
print(f'Площадь кольца равна: {S3}')