#Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между
# ними S км. Определить расстояние между ними через T часов, если автомобили
# удаляются друг от друга. Данное расстояние равно сумме начального
# расстояния и общего пути, проделанного автомобилями; общий путь = время · суммарная скорость.
V1 = float(input('Скорость 1: '))
V2 = float(input('Скорость 2: '))
S = float(input('Начальное расстояние: '))
T = float(input('Время: '))
S_new = S + (V1 + V2) * T
print(f'Расстояние через {T} часов {S_new}')
